{"_id":{"$oid":"6226b595c43e04c89cd5ce1b"},"name":"Cute Caswell Hill Suite","brief":"This bright basement suite, in a charming 1920s character home, is the perfect accommodation for someone looking to stay close to Riversdale and downtown Saskatoon.","description":"This bright basement suite, in a charming 1920s character home, is the perfect accommodation for someone looking to stay close to Riversdale and downtown Saskatoon.","image":"1.jpg","amenities":"Kitchen,Wifi,Free parking on premises,TV,Washer,Dryer,Central air conditioning,Bathtub,","featured":true}
{"_id":{"$oid":"6226b595c43e04c89cd5ce1c"},"name":"Bright, Spacious Basement Suite","brief":"Spacious and bright basement suite in a quiet area with mature trees. Only a short walk to grocery stores, Tim Hortons, Starbucks and gas station. Close to bus links to the University of Saskatchewan, Broadway and Downtown.","description":"Spacious and bright basement suite in a quiet area with mature trees. Only a short walk to grocery stores, Tim Hortons, Starbucks and gas station. Close to bus links to the University of Saskatchewan, Broadway and Downtown.","image":"2.jpg","amenities":"Bathtub,Hair dryer,Shampoo,Hot water,Washer,Dryer,Bed linens,Iron,Air conditioning,Smoke alarm,Wifi,Kitchen,Refrigerator,Cooking basics,Freezer,Coffee maker,Dining table","featured":false}
{"_id":{"$oid":"6226b595c43e04c89cd5ce1d"},"name":"Brighton: Stylish 2-BR","brief":"The space invites guests to relax while they visit the beautiful city of Saskatoon.This open concept kitchen and living room has a welcoming atmosphere that braces for your relaxation.","description":"The space invites guests to relax while they visit the beautiful city of Saskatoon.This open concept kitchen and living room has a welcoming atmosphere that braces for your relaxation.We developed the space for both guests and ourselves to find solace in the city.Turn the light on the brick wall, sit, relax, watch Netflix, or have a glass of wine.Whether your stay is a result of business or pleasure,we welcome and look forward to your visit!","image":"3.jpg","amenities":"Bathtub,Hair dryer,Shampoo,Hot water,Washer,Dryer,Bed linens,Iron,Air conditioning,Smoke alarm,Wifi,Kitchen,Refrigerator,Cooking basics,Freezer,Coffee maker,Dining table","featured":true}
{"_id":{"$oid":"622b729733ce4e7328dee62b"},"name":"York Executive Properties","brief":"We offer fully furnished one and two bedroom condo's for short and long term stays. Our properties are centrally located downtown Saskatoon. All of the suites have a modern contemporary design. Daily and monthly rates are available.","description":"We offer fully furnished one and two bedroom condo's for short and long term stays. Our properties are centrally located downtown Saskatoon. All of the suites have a modern contemporary design. Daily and monthly rates are available. ((PHONE NUMBER HIDDEN)<br><strong>The space</strong><br>All of the suites are fully furnished and include wifi, local phone, in suite laundry, parking and cable TV.<br><strong>Guest access</strong><br>Some of the condo's have a gym. YWCA is across the street for a full fitness facility.","image":"4.webp","amenities":"Kitchen,Wifi,Free parking on premises,Hot tub,TV with standard cable,Elevator,Washer,Dryer,Air conditioning"}
{"_id":{"$oid":"622b729733ce4e7328dee62c"},"name":"Cozy Stonebridge 4 Bedroom Home","brief":"This home has 4 Bedrooms with Queen size beds, 2 Full Bathrooms and a double attached garage.","description":"This home has 4 Bedrooms with Queen size beds, 2 Full Bathrooms and a double attached garage. <br>Located on a quiet, safe street.<br>Master bedroom has a private en suite bathroom & the other bedrooms share a full bath on main floor.<br>House has air conditioning, accessible back deck and yard from the well equipped kitchen, great for entertaining! 1 block from large park, ball diamond & walking paths.<br>Unlimited amenities in the Stonebridge area. Easy access to Circle Drive and Downtown Saskatoon.<br><strong>The space</strong><br>This home clean, bright and welcoming home is fully furnished, with free unlimited wifi available to guests.<br>Smart TV located in the living room comes with Netflix.<br>Full size kitchen has stainless steel appliances, bartop and dining room seating.<br>The kitchen is fully equipped with cutlery, plates, pots/pans. A complimentary coffee bar is provided to guests.<br>Washer & dryer located in basement.<br>All 4 bedrooms contain spacious Queen size beds for a comfortable stay with hypoallergenic duvets.<br>The basement area is designated as the 4th bedroom, separate from the other 3 bedrooms - which are located on the main floor.<br>Master bedroom has private en suite & large walk in closet.<br>House has an insulated double attached garage and 3 additional parking spots in the front driveway. Back yard has convenient access to deck from kitchen.<br>This home is perfect for entertaining, family gatherings or a quiet getaway in a peaceful neighborhood!<br>Absolutely no pets allowed.<br>No unauthorized guests overnight, and absolutely NO parties permitted - all events in the home are to be approved by the host.<br>Guests who break house rules and host unauthorized parties will be charged a penalty of $500.<br>Please respect this home during your stay, so we can continue to be provide a clean, beautiful home for you and future guests.<br><strong>Guest access</strong><br>Full access to main floor of house, basement where washer/dryer are located, and basement area designated as 4th bedroom. Remainder of basement is separated into a legal suite. This suite has a private entrance and living space entirely separate from the basement area that the 4th bedroom is in. There is no interaction between the 4 bedroom home, and the legal suite.","image":"5.webp","amenities":"Bathtub,Hair dryer,Shampoo,Hot water,Washer,Dryer,Bed linens,Iron,Air conditioning,Smoke alarm,Wifi,Kitchen,Refrigerator,Cooking basics,Freezer,Coffee maker,Dining table"}
{"_id":{"$oid":"622b822133ce4e7328dee62d"},"name":"Beautiful Townhouse with Free parking","brief":"This gorgeous 3 Bedroom townhouse is located in Stonebridge, the Heart of Saskatoon. Safe & quiet neighbourhood. You will enjoy easy access to everything from this centrally located place and highway is right around the corner.","description":"This gorgeous 3 Bedroom townhouse is located in Stonebridge, the Heart of Saskatoon. Safe & quiet neighbourhood. You will enjoy easy access to everything from this centrally located place and highway is right around the corner.<br><br>3 minutes drive to:<br>- Tim Hortons/ Mcdonalds<br>- Starbucks<br>- Canadian Brewhouse<br>- Sobeys<br>- Shoppers<br>and many other amenities<br><strong>The space:</strong><br>You will have the entire guest suite for your self. 1 free parking in front of the townhouse and street parking close to the townhouseThe space<br>Spacious townhouse. Can get to everywhere in the city in 15-20 minutes.<br>10 minutes drive to :<br>- Downtown/ Broadway<br>- Centre mall/ Midtown mall<br>- 8th street<br>- lots of restaurant and convenience/grocery stores near buy.<br>Other things to note<br>Please park in the right parking spot to avoid parking tickets by parking at someone else’s parking spot","image":"6.webp","amenities":"Bathtub,Hair dryer,Shampoo,Hot water,Washer,Dryer,Bed linens,Iron,Air conditioning,Smoke alarm,Wifi,Kitchen,Refrigerator,Cooking basics,Freezer,Coffee maker,Dining table"}
